---
kind: property
id: P:Autodesk.Revit.DB.ConnectorElement.Shape
source: html/f4d2381c-9a7b-983d-d170-71cc3128c492.htm
---
# Autodesk.Revit.DB.ConnectorElement.Shape Property

The shape of the connector.

## Syntax (C#)
```csharp
public virtual ConnectorProfileType Shape { get; }
```

## Remarks
ConnectorProfileType::Invalid if the connector is electrical or undefined.